tap "epk/epk"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Vi 'workalike' with many additional features
brew "vim"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# GPU-accelerated terminal emulator
cask "alacritty"
cask "font-sf-mono-nerd-font"
# Open-source code editor
cask "visual-studio-code"
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dsznajder.es7-react-js-snippets"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "ghostwithahoodie.zednos-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "illixion.vscode-vibrancy-continued"
vscode "james-yu.latex-workshop"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
